In [5]:
import pandas as pd
pd.DataFrame([('apple', 160), ('orange', 30), ('ki wi', 80), ('banana', 120)], columns=['name', 'price'])
data = {
'fruit': ['Apple', 'Orange', 'Kiwi', 'Banana'],
'price': [160, 30, 80, 120],
'order': [12, 30, 8, 21]
}
df = pd.DataFrame(data)
df['total'] = df['order'] * df['price']
df

    fruit  order  price  total
0   Apple     12    160   1920
1  Orange     30     30    900
2    Kiwi      8     80    640
3  Banana     21    120   2520

In [3]:
df['fruit']

0     Apple
1    Orange
2      Kiwi
3    Banana
Name: fruit, dtype: object

In [6]:
df[['fruit', 'total']]

    fruit  total
0   Apple   1920
1  Orange    900
2    Kiwi    640
3  Banana   2520

In [7]:
df.head(2)

    fruit  order  price  total
0   Apple     12    160   1920
1  Orange     30     30    900

In [8]:
df[1:3]

    fruit  order  price  total
1  Orange     30     30    900
2    Kiwi      8     80    640

In [9]:
 df[2:]

    fruit  order  price  total
2    Kiwi      8     80    640
3  Banana     21    120   2520

In [10]:
df.loc[[0, 3]]

    fruit  order  price  total
0   Apple     12    160   1920
3  Banana     21    120   2520

In [11]:
df.sample(n=2)

    fruit  order  price  total
0   Apple     12    160   1920
1  Orange     30     30    900

In [13]:
df[df.price > 100]

    fruit  order  price  total
0   Apple     12    160   1920
3  Banana     21    120   2520

In [14]:
df.where(df.price > 100)

    fruit  order  price   total
0   Apple   12.0  160.0  1920.0
1     NaN    NaN    NaN     NaN
2     NaN    NaN    NaN     NaN
3  Banana   21.0  120.0  2520.0

In [15]:
df.where(df.price > 100).dropna()

    fruit  order  price   total
0   Apple   12.0  160.0  1920.0
3  Banana   21.0  120.0  2520.0

In [16]:
df.where(df.price > 100).fillna(df.mean())

    fruit  order  price   total
0   Apple  12.00  160.0  1920.0
1     NaN  17.75   97.5  1495.0
2     NaN  17.75   97.5  1495.0
3  Banana  21.00  120.0  2520.0

In [17]:
df.apply(lambda x: x.fruit.upper(), axis=1)

0     APPLE
1    ORANGE
2      KIWI
3    BANANA
dtype: object